row,column=map(int,input().split())
test=[
    [(0,0),(1,0),(2,0),(3,0)],#1
    [(0,0),(0,1),(0,2),(0,3)],#2
    [(0,0),(0,1),(1,0),(1,1)],#3
    [(0,0),(1,0),(2,0),(2,1)],#4
    [(0,1),(1,1),(2,1),(2,0)],#5
    [(0,0),(1,0),(0,1),(0,2)],#6
    [(0,0),(1,0),(1,1),(1,2)],#7
    [(0,0),(0,1),(1,1),(2,1)],#8
    [(0,0),(0,1),(1,0),(2,0)],#9
    [(1,0),(1,1),(1,2),(0,2)],#10
    [(0,0),(0,1),(0,2),(1,2)],#11
    [(0,0),(1,0),(1,1),(2,1)],#12
    [(0,1),(1,1),(1,0),(2,0)],#13
    [(1,0),(1,1),(0,1),(0,2)],#14
    [(0,0),(0,1),(1,1),(1,2)],#15
    [(0,1),(1,1),(1,0),(1,2)],#16
    [(0,0),(0,1),(0,2),(1,1)],#17
    [(0,0),(1,0),(2,0),(1,1)],#18
    [(0,1),(1,0),(1,1),(2,1)],#19
    ]
matrix=[]
for _ in range(row):
    matrix.append(list(map(int,input().split())))
result=-1
for i in range(row):
    for j in range(column):
        for ex in test: #19개의 도형 을 한개씩 검사
            value=0
            for dx,dy in ex:
                nx=dx+i
                ny=dy+j
                # 해당 index 를 벗어나면 그냥 버려
                # out index 라면 그 블록 을 빠져나감 
                if nx<0 or nx>=row or ny<0 or ny>=column:
                    break
                value+=matrix[nx][ny]
            if value>result:
                result=value
print(result)
            
